{"backend": "tensorflow", "keras_version": "2.0.5", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "bias_regularizer": null, "filters": 32, "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "relu", "use_bias": true, "padding": "valid", "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "name": "conv2d_1", "activity_regularizer": null, "batch_input_shape": [null, 33, 50, 1]}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_1", "data_format": "channels_last", "strides": [2, 2], "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "units": 500, "bias_constraint": null, "kernel_regularizer": null, "activation": "relu", "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "name": "dense_1"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "units": 1, "bias_constraint": null, "kernel_regularizer": null, "activation": "linear", "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "name": "dense_2"}}]}