{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"dtype": "float32", "filters": 32, "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_6", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "valid", "bias_constraint": null, "batch_input_shape": [null, 33, 50, 1], "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_6", "padding": "valid", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"dtype": "float32", "filters": 32, "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_7", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "padding": "valid", "bias_constraint": null, "batch_input_shape": [null, 33, 50, 1], "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_7", "padding": "valid", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_3", "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "units": 500, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_6", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_3", "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "units": 7, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_7", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "activation": "softmax", "bias_regularizer": null, "activity_regularizer": null}}], "keras_version": "2.0.5", "backend": "tensorflow"}