{"keras_version": "2.0.5", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "use_bias": true, "activity_regularizer": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "filters": 32, "dilation_rate": [1, 1], "name": "conv2d_9", "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "batch_input_shape": [null, 33, 50, 1], "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_constraint": null, "strides": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_9", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "use_bias": true, "activity_regularizer": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "filters": 32, "dilation_rate": [1, 1], "name": "conv2d_10", "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "batch_input_shape": [null, 33, 50, 1], "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_constraint": null, "strides": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_10", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_13", "trainable": true, "rate": 0.5}}, {"class_name": "Flatten", "config": {"name": "flatten_5", "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "trainable": true, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "activation": "relu", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.019999999552965164, "l1": 0.0}}, "name": "dense_13", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_14", "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"bias_constraint": null, "trainable": true, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "activation": "relu", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.019999999552965164, "l1": 0.0}}, "name": "dense_14", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_15", "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"bias_constraint": null, "trainable": true, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 7, "activation": "softmax", "kernel_regularizer": null, "name": "dense_15", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "kernel_constraint": null}}], "backend": "tensorflow"}